from scipy.spatial.distance import cosine
import pandas as pd
import numpy as np
import os

answer_array = np.array([
    'โปรตีน ช่วยซ่อมแซมส่วนที่สึกหรอ สร้างกล้ามเนื้อ',  # MAPPED
    'วิตามินเกลือแร่รวมและไฟโตนิวเทรียนท์',  # MAPPED
    'สารต้านอนุมูลอิสระ ช่วยกำจัดสารพิษต่างๆ',  # MAPPED
    'น้ำมันปลา บำรุงสมอง สายตา ผิวพรรณ',  # MAPPED
    'ใยอาหาร ช่วยเรื่องการขับถ่าย จากการทานผักผลไม้ไม่พอ',  # MAPPED
    'วิตามินดี กระดูกแข็งแรง',  # MAPPED
    'วิตามินซี เสริมภูมิคุ้มกัน แก้หวัด',  # MAPPED
    'วิตามินบีรวม ให้คุณมีพลังงานตลอดทั้งวัน',  # MAPPED
    'บำรุงกระดูก เช่น แคลเซียม วิตามินดี',  # MAPPED
    'บำรุงข้อต่อ เช่น กลูโคซามีน คอนดอยติน',
    'บำรุงสมอง เช่น น้ำมันปลา',
    'บำรุงลำไส้ การย่อยอาหาร เช่น โปรไบโอติกส์ เอนไซม์ช่วยย่อย',
    'ช่วยเพิ่มพลังงาน เช่น วิตามินบี โสมไซบีเรีย',
    'บำรุงสายตา เช่น เบต้าแคโรทีน ลูทีนซีแซนทีน',
    'เพิ่มสมาธิและความจำ เช่น ซีสแทนเซ',
    'บำรุงหัวใจ เช่น กระเทียม โคคิวเท็น สารสกัดจากชาเขียว',
    'ภูมิต้านทาน เช่น เอกไคนีเซีย วิตามินซี สารสกัดจากอบเชย',
    'บำรุงต่อมลูกหมาก เช่น Saw Palmetto and Nettle Root',
    'ช่วยเรื่องการนอน เช่น เมลาโทนิน',
    'ช่วยเรื่องความเครียด เช่น เวอราเรียน'
])

intent_to_answer = {
    "VPROTEIN": "โปรตีน ช่วยซ่อมแซมส่วนที่สึกหรอ สร้างกล้ามเนื้อ",
    "VMULTIVITAMIN": 'วิตามินเกลือแร่รวมและไฟโตนิวเทรียนท์',
    "VANTIOXIDANT": 'สารต้านอนุมูลอิสระ ช่วยกำจัดสารพิษต่างๆ',
    "VFISHOIL": 'น้ำมันปลา บำรุงสมอง สายตา ผิวพรรณ',
    "VFIBER": 'ใยอาหาร ช่วยเรื่องการขับถ่าย จากการทานผักผลไม้ไม่พอ',
    "VVITD": 'วิตามินดี กระดูกแข็งแรง',
    "VVITC": 'วิตามินซี เสริมภูมิคุ้มกัน แก้หวัด',
    "VVITB": 'วิตามินบีรวม ให้คุณมีพลังงานตลอดทั้งวัน',
    "VCALCIUM": 'บำรุงกระดูก เช่น แคลเซียม วิตามินดี',
    "VGLUCO": 'บำรุงข้อต่อ เช่น กลูโคซามีน คอนดอยติน',
    "VPROBIOTIC": 'บำรุงลำไส้ การย่อยอาหาร เช่น โปรไบโอติกส์ เอนไซม์ช่วยย่อย',
    "VGINSENG": 'ช่วยเพิ่มพลังงาน เช่น วิตามินบี โสมไซบีเรีย',
    "VBETACAROTINE": 'บำรุงสายตา เช่น เบต้าแคโรทีน ลูทีนซีแซนทีน',
    "VCYSTANSE": 'เพิ่มสมาธิและความจำ เช่น ซีสแทนเซ',
    "VCOQTEN": 'บำรุงหัวใจ เช่น กระเทียม โคคิวเท็น สารสกัดจากชาเขียว',
    "VACKYNESIA": 'ภูมิต้านทาน เช่น เอกไคนีเซีย วิตามินซี สารสกัดจากอบเชย',
    "VANTA": 'บำรุงต่อมลูกหมาก เช่น Saw Palmetto and Nettle Root',
    "VMELATONIN": 'ช่วยเรื่องการนอน เช่น เมลาโทนิน',
    # 'ช่วยเรื่องความเครียด เช่น เวอราเรียน' # NO MAPPING
}

answer_to_supplement = {
    'โปรตีน ช่วยซ่อมแซมส่วนที่สึกหรอ สร้างกล้ามเนื้อ': ["โปรตีน"],
    'วิตามินเกลือแร่รวมและไฟโตนิวเทรียนท์': ['วิตามินเกลือแร่รวมและไฟโตนิวเทรียนท์'],
    'สารต้านอนุมูลอิสระ ช่วยกำจัดสารพิษต่างๆ': ['เรสเวอราทอล', 'วิตามินซี', 'โคคิวเท็น',
                                                'ลองอัลฟ่าลิปโปอิกแอซิด'],
    'น้ำมันปลา บำรุงสมอง สายตา ผิวพรรณ': ['น้ำมันปลา'],
    'ใยอาหาร ช่วยเรื่องการขับถ่าย จากการทานผักผลไม้ไม่พอ': ['ไฟเบอร์'],
    'วิตามินดี กระดูกแข็งแรง': ["วิตามินดี"],
    'วิตามินซี เสริมภูมิคุ้มกัน แก้หวัด': ["วิตามินซี"],
    'วิตามินบีรวม ให้คุณมีพลังงานตลอดทั้งวัน': ["วิตามินบีรวม"],
    'บำรุงกระดูก เช่น แคลเซียม วิตามินดี': ["แคลเซียม", "วิตามินดี"],
    'บำรุงข้อต่อ เช่น กลูโคซามีน คอนดอยติน': ["กลูโคซามิน", "คอนดอยติน"],
    'บำรุงสมอง เช่น น้ำมันปลา': ["น้ำมันปลา"],
    'บำรุงลำไส้ การย่อยอาหาร เช่น โปรไบโอติกส์ เอนไซม์ช่วยย่อย': ["โปรไบโอติกส์", "เอนไซม์ช่วยย่อย"],
    'ช่วยเพิ่มพลังงาน เช่น วิตามินบี โสมไซบีเรีย': ["วิตามินบี", "โสมไซบีเรีย"],
    'บำรุงสายตา เช่น เบต้าแคโรทีน ลูทีนซีแซนทีน': ["เบต้าแคโรทีน", "ลูทีนซีแซนทีน"],
    'เพิ่มสมาธิและความจำ เช่น ซีสแทนเซ': ["ซีสแทนเซ"],
    'บำรุงหัวใจ เช่น กระเทียม โคคิวเท็น สารสกัดจากชาเขียว': ["กระเทียม", "โคคิวเท็น", "สารสกัดจากชาเขียว"],
    'ภูมิต้านทาน เช่น เอกไคนีเซีย วิตามินซี สารสกัดจากอบเชย': ["เอกไคนีเซีย", "วิตามินซี", "สารสกัดจากอบเชย"],
    'บำรุงต่อมลูกหมาก เช่น Saw Palmetto and Nettle Root': ["Saw Palmetto and Nettle Root"],
    'ช่วยเรื่องการนอน เช่น เมลาโทนิน': ["เมลาโทนิน"],
    'ช่วยเรื่องความเครียด เช่น เวอราเรียน': ["เวอราเรียน"]
}

answer_df = pd.Series(answer_array)
# Directory #
path_name = os.path.dirname(os.path.abspath(__file__))

pre_train_df = pd.read_csv(os.path.join(path_name, 'pre_train.csv'), index_col=[0])


def answer_similarity_text(answer=''):
    return answer_df.iloc[0]


def answer_is_in_answer_array(answer=''):
    if answer in answer_array:
        return True
    else:
        return False


def recommendation(input_text, number=5):
    my_feature = pd.DataFrame(np.zeros((1, len(answer_df))), columns=answer_df)
    my_feature[input_text] = 3

    similarity = []
    close_to_uid = 0

    # ค้นหา similarity ว่าคล้ายกับ id ไหน
    for idx in range(len(pre_train_df)):
        similarity.append(1 - cosine(my_feature, pre_train_df.iloc[idx].values))
        similarity = pd.Series(similarity).fillna(0).tolist()
        close_to_uid = np.argsort(similarity)[-1]

    res = list(pre_train_df.T[close_to_uid].sort_values(ascending=False)[0:number].index)
    return res


def get_recommendation(input_text='', number_of_recommend=1):
    # สร้าง data frame เปล่าแล้วใส่ feature ลงไปเป็นคะแนน 3
    if answer_is_in_answer_array(input_text):
        return recommendation(input_text, number_of_recommend)
    else:
        return recommendation(answer_similarity_text(input_text), number_of_recommend)

# วิธีใช้
# get_recommendation(string คำตอบของแอนนา, int จำนวน Recommendation)

# ตัวอย่าง
# get_recommendation('ช่วยเรื่องการนอน เช่น เมลาโทนิน',5)
# get_recommendation('ตอบ มั่วๆ',5)

# วิธีนำไปใช้ 
# 1. สามารถอัพเดท model ด้วย google colab ที่ทำไว้ครับ https://colab.research.google.com/drive/1wZoaYql-A9qEeJG8CINw0zuZo0RfvBIk
# 2. นำไฟล์ ที่เทรนใหม่มา วางไว้ ที่ Directory ที่ตรงกับ ##Directory##
# 3. รันได้เลยใช้  get_recommendation(คำจาก anna อะไรก็ได้,5)
